In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
list1 = list('aaabbbccdd')
list2 =[1,2,3]*3
list2.insert(-2,2)
ser = Series(np.random.randn(10),index=[list1,list2])
ser

a  1   -0.324426
   2    0.476247
   3    1.216745
b  1   -0.394894
   2    0.901137
   3    0.350921
c  1   -0.316367
   2   -0.764943
d  2    1.142472
   3   -0.572824
dtype: float64

In [3]:
ser.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [4]:
ser['b']

1   -0.394894
2    0.901137
3    0.350921
dtype: float64

In [5]:
ser['a':'c']

a  1   -0.324426
   2    0.476247
   3    1.216745
b  1   -0.394894
   2    0.901137
   3    0.350921
c  1   -0.316367
   2   -0.764943
dtype: float64

In [22]:
ser

a  1   -0.324426
   2    0.476247
   3    1.216745
b  1   -0.394894
   2    0.901137
   3    0.350921
c  1   -0.316367
   2   -0.764943
d  2    1.142472
   3   -0.572824
dtype: float64

In [26]:
for i in list('ab'):    
    print(ser[i,2])

0.476246751842
0.901137120576

In [29]:
ser.unstack()

          1         2         3
a -0.324426  0.476247  1.216745
b -0.394894  0.901137  0.350921
c -0.316367 -0.764943       NaN
d       NaN  1.142472 -0.572824

In [32]:
ser.unstack().stack()

a  1   -0.324426
   2    0.476247
   3    1.216745
b  1   -0.394894
   2    0.901137
   3    0.350921
c  1   -0.316367
   2   -0.764943
d  2    1.142472
   3   -0.572824
dtype: float64

In [33]:
df = DataFrame(np.arange(12).reshape(4,3),
              index=[list('aabb'),[1,2,1,2]],
              columns=[['One','One','Two'],
                      ['red','blue','red']])
df

    One      Two
    red blue red
a 1   0    1   2
  2   3    4   5
b 1   6    7   8
  2   9   10  11

In [34]:
df.index.names = ['key1','key2']
df.columns.names = ['state','color']
df

state     One      Two
color     red blue red
key1 key2
a    1      0    1   2
     2      3    4   5
b    1      6    7   8
     2      9   10  11

In [35]:
df['One']

color      red  blue
key1 key2
a    1       0     1
     2       3     4
b    1       6     7
     2       9    10

In [36]:
df.swaplevel('key1','key2')

state     One      Two
color     red blue red
key2 key1
1    a      0    1   2
2    a      3    4   5
1    b      6    7   8
2    b      9   10  11

In [39]:
df.sort_index(level=1)

state     One      Two
color     red blue red
key1 key2
a    1      0    1   2
b    1      6    7   8
a    2      3    4   5
b    2      9   10  11

In [40]:
df.swaplevel('key1','key2').sort_index(level=0)

state     One      Two
color     red blue red
key2 key1
1    a      0    1   2
     b      6    7   8
2    a      3    4   5
     b      9   10  11

In [41]:
df.sum()

state  color
One    red      18
       blue     22
Two    red      26
dtype: int64

In [42]:
df

state     One      Two
color     red blue red
key1 key2
a    1      0    1   2
     2      3    4   5
b    1      6    7   8
     2      9   10  11

In [43]:
df.sum(level='key2')

state One      Two
color red blue red
key2
1       6    8  10
2      12   14  16

In [44]:
df.sum(level='color',axis=1)

color      blue  red
key1 key2
a    1        1    2
     2        4    8
b    1        7   14
     2       10   20